blog/app/controllers/articles_controller.rb

    def show
        @articles = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @article = Article.new
        @article.name = params[:name]
        @article.body = params[:body]

        if @article.save
---
INSERT INTO "articles" ("name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Oranges"], ["body", "orange banana yellow oranges"], ["created_at", "2023-03-13 07:18:20.951331"], ["updated_at", "2023-03-13 07:18:20.951331"]]

    def update
        @article = Article.find(params[:id])
        if @article.update(params.require(:article).permit(:name, :body))
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "1234566778"], ["updated_at", "2023-03-11 09:01:02.679455"], ["id", 1]]