blog/app/controllers/rice_controller.rb

SELECT "rice".* FROM "rice"
---
  def index
    @rice = Rice.all

INSERT INTO "rice" ("kg", "price", "brand", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["kg", 25], ["price", 30.0], ["brand", "Jasmine Rice"], ["created_at", "2023-03-09 12:09:42.641221"], ["updated_at", "2023-03-09 12:09:42.641221"]]
---
  def create
    @rice = Rice.new(rice_params)

    respond_to do |format|
      if @rice.save

SELECT "rice".* FROM "rice" WHERE "rice"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_rice
      @rice = Rice.find(params[:id])